InformationRegisters/ПубликацииЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПубликацииЭлектронныхКурсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтруктураКурса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресурсы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭлектронныйКурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеКурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИзмененныеЭлектронныеКурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИзмененныеЭлектронныеКурсы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГотовКПубликации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭлектронныйКурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеКурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбщиеНастройкиЭлектронногоОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОбщиеНастройкиЭлектронногоОбучения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресОбщегоКаталогаНаВебСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКОбщемуКаталогуНаВебСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОбщийКаталогВТонкомКлиенте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормироватьВОбщемКаталогеМанифестCMI5</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПубликацииЭлектронныхКурсов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ЭлектронныйКурс",
			"ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция Публикация(Знач ЭлектронныйКурс, Знач ДатаИзмененияСуществующихДанных = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйКурс) Тогда
		ВызватьИсключение НСтр("ru = 'Электронный курс не задан'");
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПубликацииЭлектронныхКурсов.ДатаПубликации КАК ДатаИзменения,
		|	ПубликацииЭлектронныхКурсов.СтруктураКурса КАК СтруктураКурса,
		|	ПубликацииЭлектронныхКурсов.Ресурсы КАК Ресурсы
		|ИЗ
		|	РегистрСведений.ПубликацииЭлектронныхКурсов КАК ПубликацииЭлектронныхКурсов
		|ГДЕ
		|	ПубликацииЭлектронныхКурсов.ЭлектронныйКурс = &ЭлектронныйКурс
		|	И &ОтборПоДатеИзменения";
	
	Если ДатаИзмененияСуществующихДанных <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоДатеИзменения", "ПубликацииЭлектронныхКурсов.ДатаПубликации > &ДатаИзмененияСуществующихДанных");
		Запрос.УстановитьПараметр("ДатаИзмененияСуществующихДанных", ДатаИзмененияСуществующихДанных);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоДатеИзменения", "ИСТИНА")
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЭлектронныйКурс", ЭлектронныйКурс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	ВыборкаДетальныеЗаписи.Следующий();
	
	ДанныеДляВозврата = ИзучениеЭлектронныхКурсовСлужебный.ПустаяСтруктураДанныхПубликации();
	ДанныеДляВозврата.ДатаИзменения = ВыборкаДетальныеЗаписи.ДатаИзменения;
	ДанныеДляВозврата.СтруктураКурса = ВыборкаДетальныеЗаписи.СтруктураКурса.Получить();
	ДанныеДляВозврата.Ресурсы = ВыборкаДетальныеЗаписи.Ресурсы.Получить();
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеДляВозврата);
	
КонецФункции

Процедура Опубликовать(ЭлектронныйКурс, ОпубликоватьБезРазрешения, ИдентификаторФормы = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйКурс) Тогда
		ВызватьИсключение НСтр("ru = 'Электронный курс не задан'");
	КонецЕсли;		
	
	Если НЕ ОпубликоватьБезРазрешения И НЕ РегистрыСведений.ИзмененныеЭлектронныеКурсы.МожноПубликоватьКурс(ЭлектронныйКурс) Тогда
		Возврат; // Нет разрешения не публикацию (курс еще редактируется)
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
			
		// Фиксируем факт публикации, чтобы не было ложных срабатываний о том, что курс не опубликован
		
		РегистрыСведений.ИзмененныеЭлектронныеКурсы.ЗафиксироватьПубликациюКурса(ЭлектронныйКурс);
		
		// Сохраняем в базу данные опубликованного курса
		
		ДанныеПубликации = ИзучениеЭлектронныхКурсовСлужебный.ДанныеПубликацииЭлектронногоКурса(ЭлектронныйКурс);
		
		Запись = РегистрыСведений.ПубликацииЭлектронныхКурсов.СоздатьМенеджерЗаписи();
		Запись.ДатаПубликации = ТекущаяДатаСеанса();
		Запись.ЭлектронныйКурс = ЭлектронныйКурс;	
		Запись.СтруктураКурса = Новый ХранилищеЗначения(ДанныеПубликации.СтруктураКурса);
		Запись.Ресурсы = Новый ХранилищеЗначения(ДанныеПубликации.Ресурсы);		
		Запись.Записать();
		
		// Выгружаем на диск (на сервере)
		
		ПутьКОбщемуКаталогу = РегистрыСведений.ОбщиеНастройкиЭлектронногоОбучения.Значение("ПутьКОбщемуКаталогуНаВебСервере");
		
		Если ЗначениеЗаполнено(ПутьКОбщемуКаталогу) Тогда		
			ПутьККаталогуЭлектронныйКурсов = ИзучениеЭлектронныхКурсовСлужебный.ПутьККаталогуЭлектронныхКурсов(ПутьКОбщемуКаталогу);
			ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ВыполнитьНачальноеЗаполнениеКаталогаЭлектронныхКурсов(ПутьККаталогуЭлектронныйКурсов);
			ПутьККаталогуРесурсов = ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ПутьККаталогуРесурсовКурса(ПутьККаталогуЭлектронныйКурсов, ЭлектронныйКурс);
			ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.СкопироватьНаДискДанныеПубликации(ДанныеПубликации, ПутьККаталогуРесурсов, ЭлектронныйКурс,,ИдентификаторФормы); 
		КонецЕсли;		
		
		ЗафиксироватьТранзакцию();
	
	Исключение
 
 		ОтменитьТранзакцию();
		ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;	
	
КонецПроцедуры

Процедура УдалитьПубликацию(ЭлектронныйКурс) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйКурс) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
	
		РегистрыСведений.ИзмененныеЭлектронныеКурсы.ЗафиксироватьПубликациюКурса(ЭлектронныйКурс);
		
		Набор = РегистрыСведений.ПубликацииЭлектронныхКурсов.СоздатьНаборЗаписей();
		Набор.Отбор.ЭлектронныйКурс.Установить(ЭлектронныйКурс);
		Набор.Записать();
		ЗафиксироватьТранзакцию();
	
	Исключение
 
 		ОтменитьТранзакцию();
		ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
